In [1]:
import pandas as pd
from sqlalchemy import create_engine

# Conectando direto no Postgres para criar os dados
engine_pg = create_engine('postgresql://postgres:senha123@localhost:5432/postgres')

df = pd.DataFrame({
    'id': range(1, 6),
    'produto': ['Notebook', 'Mouse', 'Teclado', 'Monitor', 'Cabo HDMI'],
    'preco': [3500, 50, 150, 1200, 30]
})

df.to_sql('produtos_loja', engine_pg, if_exists='replace', index=False)
df

   id    produto  preco
0   1   Notebook   3500
1   2      Mouse     50
2   3    Teclado    150
3   4    Monitor   1200
4   5  Cabo HDMI     30

In [2]:
df = pd.DataFrame({
    'id': range(1, 6),
    'nome': ['gaule', 'pedro', 'thiago', 'joão', 'julio'],
    'cargo': ['ceo', 'analista', 'gerente', 'diretor', 'estagiário']
})

df.to_sql('funcionarios', engine_pg, if_exists='replace', index=False)
df

   id    nome       cargo
0   1   gaule         ceo
1   2   pedro    analista
2   3  thiago     gerente
3   4    joão     diretor
4   5   julio  estagiário

In [2]:
query = """
SELECT *
FROM produtos_loja
WHERE preco > 100;
"""

resultado = pd.read_sql(query, engine_pg)

print(resultado)

   id   produto  preco
0   1  Notebook   3500
1   3   Teclado    150
2   4   Monitor   1200

In [3]:
query = "SELECT produto, preco FROM produtos_loja;"
df_select = pd.read_sql(query, engine_pg)

In [4]:
query = "SELECT * FROM produtos_loja ORDER BY preco DESC;"
df_sorted = pd.read_sql(query, engine_pg)

In [5]:
query = "SELECT * FROM produtos_loja ORDER BY preco ASC;"
df_ascending = pd.read_sql(query, engine_pg)

In [6]:
print(df_select)
print("-" * 29)
print(df_sorted)
print("-" * 29)
print(df_ascending)

     produto  preco
0   Notebook   3500
1      Mouse     50
2    Teclado    150
3    Monitor   1200
4  Cabo HDMI     30
-----------------------------
   id    produto  preco
0   1   Notebook   3500
1   4    Monitor   1200
2   3    Teclado    150
3   2      Mouse     50
4   5  Cabo HDMI     30
-----------------------------
   id    produto  preco
0   5  Cabo HDMI     30
1   2      Mouse     50
2   3    Teclado    150
3   4    Monitor   1200
4   1   Notebook   3500